{
"type": "FeatureCollection",
"name": "Paths to Kenya",
"crs": { "type": "name", "properties": { "name": "urn:ogc:def:crs:OGC:1.3:CRS84" } },
"features": [
{ "type": "Feature", "properties": { "Name": "The Makonde", "Description": "The Makonde community were brought to Kenya from Mozambique in the late 1930s by the British Empire to work the sugar cane fields as field laborers in what's now known as Kwale County on the southeastern coast of Kenya. They entered the country through the Tanzanian-Kenyan border. Today they still live in Kwale County.<br><br>Status: Gained citizenship in 2016" }, "geometry": { "type": "LineString", "coordinates": [ [ 35.529561999999899, -18.665695, 0.0 ], [ 37.906193, -0.023559, 0.0 ] ] } },
{ "type": "Feature", "properties": { "Name": "The Pemba", "Description": "<strong>The Pemba</strong> are said to have come to Kenya as early as the 1930s and settled there for fishing. At the time, the part of the coast where the Pemba settled, popularly known as the ten-mile strip, was part of the Sultanate of Zanzibar and therefore under the sovereignty of the Sultan of Zanzibar and not the British. The Pemba were technically in the same territory as Pemba island where they had come from.<br><br> This part was officially known as the Protectorate of Kenya. The British ruled inland Kenya and this was known as the Colony of Kenya. As the British ceded sovereignty over inland Kenya for independence in 1963, so did the Sultanate of Zanzibar over the ten-mile strip. Kenya then became a country made of the colony and the protectorate and the Pemba were no longer in the Sultanate of Zanzibar but in the newly formed Kenya. <br><br>They were not granted citizenship under the country's first post-independence constitution because only indigenous Kenyans were granted citizenship. Today, the Pemba live in Kwale and Kilifi counties along Kenya's southeastern coast.<br><br>Status: Stateless" }, "geometry": { "type": "LineString", "coordinates": [ [ 39.7449978, -5.4495989, 0.0 ], [ 37.906193, -0.023559, 0.0 ] ] } },
{ "type": "Feature", "properties": { "Name": "The Rundi", "Description": "The Rundi came to Kenya from Burundi, to work the sugar cane farms for the British Empire in the 1940s, according to Wanja Munaita with The Office of the United Nations High Commissioner for Refugees. They traveled through Tanzania and entered the country through Kwale County on the southeastern coast of Kenya. Today, many Rundi still live in that region, in addition to some Rundi who have come since then as refugees from conflicts in Burundi.<br><br>Status: Stateless" }, "geometry": { "type": "LineString", "coordinates": [ [ 29.918886, -3.373056, 0.0 ], [ 37.906193, -0.023559, 0.0 ] ] } },
{ "type": "Feature", "properties": { "Name": "The Nubians", "Description": "The Nubians of what is known as Sudan were brought to Kenya after being conscripted into the British Army. In the British Army, they were part of what came to be known as the King's African Rifles during British colonization of East Africa and World War I & II. When they were decommissioned in Kenya, they were given small parcels of land for farming, but no substantive compensation. They mostly live in Kibera, now part of Nairobi, where farm land they received was located.<br><br>Status: Mixed – Some of have citizenship, some do not. Some of whom have citizenship have to undergo vetting that other Kenyans do not in order to obtain identifying documents, \"such as requiring parents to provide fingerprints or to escort their adult children when applying for identity cards and passports,\" according to a 2018 report from The Office of the United Nations High Commissioner for Refugees." }, "geometry": { "type": "LineString", "coordinates": [ [ 31.3069788, 6.8769919, 0.0 ], [ 37.906193, -0.023559, 0.0 ] ] } },
{ "type": "Feature", "properties": { "Name": "The Rwandese", "Description": "The Rwandese who are stateless in Kenya are the descendants of an estimated 500 people who were brought to Kenya from Rwanda by the British Empire in the 1940s. They were brought to work tea plantations in Kericho. In 2017, they petitioned the Rwanda High Commissioner to Kenya for Kenyan citizenship.<br><br>Status: Stateless" }, "geometry": { "type": "LineString", "coordinates": [ [ 29.873888, -1.940278, 0.0 ], [ 37.906193, -0.023559, 0.0 ] ] } },
{ "type": "Feature", "properties": { "Name": "The Shona", "Description": "The Shona community migrated to Kenya in the 1960s. Initially they were welcome, a group of 100 Christian missionaries working on behalf of the Gospel of God Church, by Kenya's first President Jomo Kenyatta. His government allowed them to establish a church, but they were not granted citizenship under the country's first post-independence constitution because only indigenous Kenyans were granted citizenship. Today, many Shona live in Nairobi, Kenya's capital.<br><br>Status: Stateless" }, "geometry": { "type": "LineString", "coordinates": [ [ 31.6593595, -20.3023653, 0.0 ], [ 37.906193, -0.023559, 0.0 ] ] } },
{ "type": "Feature", "properties": { "Name": "Mozambique", "Description": "" }, "geometry": { "type": "Point", "coordinates": [ 35.529561999999899, -18.665695, 0.0 ] } },
{ "type": "Feature", "properties": { "Name": "Zimbabwe", "Description": "" }, "geometry": { "type": "Point", "coordinates": [ 31.6593595, -20.3023653, 0.0 ] } },
{ "type": "Feature", "properties": { "Name": "Rwanda", "Description": "" }, "geometry": { "type": "Point", "coordinates": [ 29.873888, -1.940278, 0.0 ] } },
{ "type": "Feature", "properties": { "Name": "South Sudan", "Description": "" }, "geometry": { "type": "Point", "coordinates": [ 31.3069788, 6.8769919, 0.0 ] } },
{ "type": "Feature", "properties": { "Name": "Burundi", "Description": "" }, "geometry": { "type": "Point", "coordinates": [ 29.918886, -3.373056, 0.0 ] } },
{ "type": "Feature", "properties": { "Name": "Tanzania", "Description": "" }, "geometry": { "type": "Point", "coordinates": [ 39.7449978, -5.4495989, 0.0 ] } },
{ "type": "Feature", "properties": { "Name": "Kenya", "Description": "" }, "geometry": { "type": "Point", "coordinates": [ 37.906193, -0.023559, 0.0 ] } }
]
}
